package game.vt.silence.game_mech.model.prehistory;

public enum Prehistory {
    _11_(
            "Жернова Столицы",
            "С вами произошло что-то поистине чудовищное.",
            "+1 Безумие, +1 Травма, +1 Талант"
    ),
    _12_(
            "Зависимость",
            "Вы впали в зависимость от чего-то или кого-то",
            "+1 Пристрастие, +1 пункт опыта"
    ),
    _13_(
            "Физическая травма",
            "Вы серьезно пострадали физически",
            "+1 Травма, +1 пункт опыта"
    ),
    _14_(
            "Заражение",
            "Необычная или редкая болезнь оказалась сильнее вашего иммунитета",
            "+1 Болезнь, +1 пункт опыта"
    ),
    _15_(
            "Потеря",
            "Что-то или кто-то важный для вас пропал, погиб или его судьба была еще хуже",
            "+1 Безумие или +1 Пристрастие, +1 пункт опыта"
    ),
    _16_(
            "Статус и репутация",
            "На вашей репутации поставлено пятно. Возможно, вам пришлось переехать, бежать или сменить имя",
            "-1 к любым Связям в любой сфере, +1 пункт опыта"
    ),
    _21_(
            "Вы вместе через многое прошли",
            "У вас появляется надежный друг",
            "Надежный друг"
    ),
    _22_(
            "Ты зависишь от этого человека",
            "Вы попали под влияние серьезного покровителя",
            "Пристрастие +1, и +2 к Связям в выбранной сфере"
    ),
    _23_(
            "Вы единственные, кто выжил",
            "У вас появляется надежный друг, с которым вас связывает чудовищное событие прошлого.",
            "Надежный друг и +1 пункт опыта; Безумие +1 либо Травма +1"
    ),
    _24_(
            "Должник",
            "Кто-то или что-то обязало вас долгом. Как быть с этим - решать вам",
            ""
    ),
    _25_(
            "Теперь вы заклятые враги",
            "У вас появляется настоящий враг, который не оставит вас в покое.",
            "Преследование, +1 пункт опыта"
    ),
    _26_(
            "Предательство",
            "Вы вероломно предали или же сами были жестоко преданы.",
            "+1 пункт опыта либо +1 Безумие и +2 пункта опыта"
    ),
    _31_(
            "Отбыл срок заключения",
            "По какой-то причине Государство наказало вас - виновного или нет.",
            "1+ к Болезни, Пристрастию или Травме; +1 пункт опыта"
    ),
    _32_(
            "Случайный свидетель",
            "Вы видели что-то, чего вам не следовало видеть",
            "Преследование, +1 пункт опыта."
    ),
    _33_(
            "Услуга банде",
            "Ваша намеренная или случайная помощь банде была высоко оценена",
            "Слово Банды или Надежный друг или +1 к Знания и Связям Криминала."
    ),
    _34_(
            "Совершил преступление",
            "Так вышло, что вы нарушили закон, и это дало свои плоды",
            "Преследование; +1 пункт опыта и Ценная вещь."
    ),
    _35_(
            "Организатор или консультант",
            "Благодаря вашим навыкам кто-то совершил преступление",
            "+1 Знание и Связи в любой сфере."
    ),
    _36_(
            "Чудовищное деяние",
            "Вы специально или случайно совершили что-то, о чем хотели бы забыть",
            "+1 Безумие, +1 пункт опыта"
    ),
    _41_(
            "Вы не знаете, как это у вас оказалось",
            "Возможно, оно было у вас всегда, или однажды нашлось в кармане…",
            "Ценная вещь"
    ),
    _42_(
            "Кто-то готов убить за это",
            "Кажется, не только вы хотели бы владеть этим…",
            "Преследование, Ценная вещь"
    ),
    _43_(
            "Необычный опыт",
            "Обстоятельства сложились так, что вы приобрели редкий талант…",
            "+1 Талант, -1 пункт опыта"
    ),
    _44_(
            "Теперь это - часть вашей жизни",
            "Вы не представляете, как будете жить без этого",
            "+1 Пристрастие, Ценная вещь"
    ),
    _45_(
            "Вы пошли на многое ради этого, и это вас изменило",
            "Вы слишком хотели овладеть этим, чтобы вовремя остановиться",
            "+1 Безумие, Ценная вещь"
    ),
    _46_(
            "Настоящий шедевр",
            "Вы сами создали это, получили в награду или в качестве наследства",
            "+1 к Знанию в выбранной сфере, Ценная вещь."
    ),
    _51_(
            "Вернуть или оставить?",
            "Вы стали обладателем чужой ценности или секрета… Как поступить?",
            "+1 Ценная вещь либо ничего"
    ),
    _52_(
            "Встать под удар",
            "Кому-то или чему-то угрожала опасность, и вы могли изменить это",
            "+1 Травма или +1 Болезнь либо ничего"
    ),
    _53_(
            "Вопрос принципа",
            "Вы могли остановиться, или перейти дорогу кому-то опасному",
            "Либо Преследование, либо ничего"
    ),
    _54_(
            "Спасительное бездействие",
            "Иногда ничего не сделать — тоже действие. Имеющее цену.",
            "Либо -1 пункт опыта, либо +1 Безумие"
    ),
    _55_(
            "Несмотря ни на что",
            "Слишком сложная задача — либо отступите, либо идите до конца",
            "Вы можете добавить еще +1 к Знаниям и Связям в выбранной сфере и получить +1 Безумие," +
                    "или вообще не получить Знания и Связи на этом этапе"
    ),
    _56_(
            "Чья-то жизнь",
            "Кто-то должен был погибнуть, и вы могли бы извлечь из этого выгоду…",
            "+1 пункт опыта либо ничего"
    ),
    _61_(
            "Успех вскружил вам голову",
            "Меж двух огней",
            "+1 Знание и Связи в выбранной сфере, +1 Безумие и +1 пункт опыта"
    ),
    _62_(
            "Меж двух огней",
            "",
            "+1 Знание и Связи в выбранной сфере, +1 Знание и Связи в любой другой сфере. " +
                    "Ваша репутация весьма скандальна, и, вероятно, кто-то затаил на вас злобу."
    ),
    _63_(
            "Уникальный опыт",
            "",
            "На выбор: +2 Знание и Связи в выбранной сфере или +1 Талант"
    ),
    _64_(
            "Редкий шанс",
            "Иногда стечения обстоятельств помогают решить любую проблему",
            "Уберите один негативный статус: Безумие, Пристрастие, Травма, Болезнь или Преследование по вашему выбору. " +
                    "Либо получите на выбор Ценную вещь или +2 пункта опыта"
    ),
    _65_(
            "Новые горизонты",
            "",
            "Доступ к уникальным навыкам* или +3 пункта опыта"
    ),
    _66_(
            "Творец своей судьбы",
            "",
            "На выбор: +3 пункта опыта, +4 пункта Знания и Связей в любых сферах, +1 Талант, " +
                    "Ценную вещь или что-либо еще по желанию персонажа или задумке автора"


    );

    private String name;
    private String description;
    private String bonuses;

    Prehistory(Object... o) {

    }

    public static Prehistory getPrehistoryByDices(int firstDice, int secondDice) {

        return Prehistory.valueOf("_" + firstDice + "" + secondDice + "_");
    }
}
